HenrikSte/esp32msi/src/main.cpp
    // Read and store file contents in buf
    f.readBytes(buf.get(), size);
    buf[size]=0; //terminating zero
    // Closing file
    f.close();
    //Serial.println(buf.get());
    Serial.println("Messagefile successfully read.");
    String errorText;
    processMessage(String(buf.get()), errorText);
    roomLabel.setHasMessageToSend(false); // do not fire a repsonse
  }
}
*/

unsigned long lastGetNextMessage = 0;
unsigned long lastPostMessage = 0;

void serverStart()
{
  
  server.on("/", HTTP_GET, [](){
    unsigned long start = millis();
    mylog("MainPage:");
    server.send(200, "text/html", getMainPage());  
    mylog(millis()-start);
    mylog("ms\n");
    
  });

  server.on("/getsecuretoken", HTTP_POST, [](){
      unsigned long start = millis();
      
    /*
      String message = "GetSecureToken:";
      getServerRequest(message);
      mylog(message);
    */
      server.send(200, "application/JSON", token);
      lastPasXInteraction = millis();
      mylog(millis()-start);
      mylog("ms\n");
  });

  server.on("/nowatchdog", HTTP_GET, [](){
      Serial.println("nowatchdog");
      server.send(200, "text/PLAIN", "watchdog disabled");
      pasXWatchDogTime = 1000000000L;
  });

  server.on("/watchdog", HTTP_GET, [](){
      Serial.println("watchdog");
      server.send(200, "text/PLAIN", "watchdog enabled");
      pasXWatchDogTime = WATCHDOGTIME;
  });
  server.on("/resetlog", HTTP_GET, [](){
      SPIFFS.remove(logFileName);
      mylog(getNow());
      mylog("\nresetlog\n");
      server.send(200, "text/PLAIN", "log reset");
  });
  server.on("/activatelog", HTTP_GET, [](){
      logActive=true;
      mylog(getNow());
      mylog("\nactivate log\n");
      server.send(200, "text/PLAIN", "log activated");
  });
  server.on("/deactivatelog", HTTP_GET, [](){
      mylog(getNow());
      mylog("\ndeactivate log\n");
      logActive=false;
      server.send(200, "text/PLAIN", "log deactivated");
  });


  server.on("/log", HTTP_GET, [](){
      unsigned long start = millis();
      mylog("log", true);
      if (logActive)
      {
        File f = SPIFFS.open(logFileName, "r");
        if (!f || f.size()==0) 
        {
          Serial.println("logfile not found");
          server.send(404, "text/PLAIN", "logfile not found");
        } 
        else 
        {
          server.streamFile(f, "text/PLAIN");
        }
      }
      else
      {
        server.send(200, "text/PLAIN", logString);
      }
      
      mylog(millis()-start);
      mylog("ms\n");
  });

  server.on("/lastsentmessage", HTTP_GET, [](){
      unsigned long start = millis();
      Serial.println("lastsentmessage");
      File f = SPIFFS.open(sentMessageFileName, "r");
      if (!f || f.size()==0) 
      {
        Serial.println("Messagefile not found");
        server.send(404, "application/xml", "Messagefile not found");
      } 
      else 
      {
        // we could open the file
        size_t size = f.size();
        // Allocate a buffer to store contents of the file.
        std::unique_ptr<char[]> buf(new char[size+1]);

        // Read and store file contents in buf
        f.readBytes(buf.get(), size);
        buf[size]=0; //terminating zero
        // Closing file
        f.close();
        //Serial.println(buf.get());
        server.send(200, "application/XML", buf.get());
      }
    Serial.print(millis()-start);
    Serial.println("ms");
  });

  server.on("/lastreceivedmessage", HTTP_GET, [](){
     unsigned long start = millis();
     Serial.println("lastreceivedmessage");
      File f = SPIFFS.open(receivedMessageFileName, "r");
      if (!f) 
      {
        Serial.println("Messagefile not found");
        server.send(404, "text/plain", "Messagefile not found");
      } 
      else 
      {
        // we could open the file
        size_t size = f.size();
        // Allocate a buffer to store contents of the file.
        std::unique_ptr<char[]> buf(new char[size+1]);

        // Read and store file contents in buf
        f.readBytes(buf.get(), size);
        buf[size]=0; //terminating zero
        // Closing file
        f.close();
        //Serial.println(buf.get());
        server.send(200, "application/XML", buf.get());
      }
    Serial.print(millis()-start);
    Serial.println("ms");
  });


  server.on("/GetNextMessage", HTTP_GET, [](){
    unsigned long start = millis();
    mylog(String("\n")+getNow() + ": ");
    mylog(start-lastGetNextMessage);
    mylog("ms<->");
    
    lastGetNextMessage = start;
    String message = "GetNextMessage";
    //getServerRequest(message);
    mylog(message);

    String response;
    toggleLED();
    
    if (!sendQueue.isEmpty())
    {
/*
      Serial.print(getNow());
      Serial.print("QueueSize:");
      Serial.print(sendQueue.count());
      Serial.print("--pop--");
*/      
      response = sendQueue.pop();

      //Serial.print("->QueueSize:");
      //Serial.print(sendQueue.count());

       //Save XML
      File f = SPIFFS.open(sentMessageFileName, "w");
      if (!f) 
      {
        mylog("Failed to open message file for writing");
      }
      else
      {
        f.print(response.c_str());
        f.close();
      }

    }
    else 
    {
      response = "<NoMessage/>";
    }
    toggleLED();
    server.send(200, "application/XML", response);
    mylog(".");
    lastPasXInteraction = millis();
    mylog(millis()-start);
    mylog("ms\n");
  });

  server.on("/PostMessage", HTTP_POST, [] () {
    unsigned long start = millis();
    String message = "PostMessage:";
    mylog(String("\n")+getNow() + ": ");
    mylog(start-lastPostMessage);
    mylog("ms<->");
    
    lastPostMessage = start;
    //getServerRequest(message);
    Serial.println(message);

    toggleLED();
    Serial.println(getNow());
    String errorString;
    bool Ok= false;
    if (server.args())
    {
      String xml = server.arg(0);
      int xmlStart = xml.indexOf('<');
      int xmlEnd   = xml.lastIndexOf('>');
    
      if (xmlEnd>=0 && xmlStart>=0)
      {
        xmlEnd++; //including the >
        xml = xml.substring(xmlStart, xmlEnd);
        if (xml.length()>0)
        {
          Ok = processMessage(xml, errorString);
          
          //Save XML
          File f = SPIFFS.open(receivedMessageFileName, "w");
          if (!f) 
          {
            Serial.println("Failed to open message file for writing");
          }
          else
          {
            f.print(xml.c_str());
            f.close();
          }

