HenrikSte/esp32msi/src/main.cpp
unsigned long nextSensorRead    = SENSORREADINTERVAL;
unsigned long nextDisplayUpdate = DISPLAYUPDATEINTERVAL;
void loop() 
{
  heap_caps_check_integrity_all(true);

  // waiting for PAS-X to start polling
  if (!setupComplete)
  {
    if (lastGetNextMessage || lastPostMessage) // did PAS-X send a message?
    {
      setupComplete = true;
      if (myType == eRoomLabel)
      {
        roomLabel.readLcdFile();
        displayLcdScreen();
      }
      else if (myType == epH)
      {
        pHMeter.readConfig();
      }
    }
  }
  else // setup IS complete, PAS-X responded, check sensors in intervalls.
  {
    if (millis() > nextSensorRead) 
    {

      nextSensorRead = millis() + SENSORREADINTERVAL;

      if (myType == eRoomLabel)
      { 
        if (readSensor()) // also reads pH
        {
          displayLcdScreen(); // #todo: necessary?
        }
        else if (dhtExists) // DHT sensor but no reading? Try again faster.
        {
          nextSensorRead = millis() + SENSORREADINTERVAL/10;
        }


        mylog(humidity);
        mylog("RH, ");
        mylog(temperature);
        mylog("C\n");
        if ((humidity > roomLabel.rhUpperLimit || humidity<roomLabel.rhLowerLimit)
          ||(temperature > roomLabel.tempUpperLimit || temperature<roomLabel.tempLowerLimit))
        {

          String batchID = roomLabel.lastBatchId;
          String PU      = roomLabel.lastPU;
          mylog("Excpetion level reached\n");
         
          if (roomLabel.systemId.length() && (batchID != lastExceptionBatchID || (millis() - lastExceptionSent>exceptionSendInterval)))
          {
            lastExceptionSent = millis();
            lastExceptionBatchID = batchID;
            String timeStampString = getUTC();

            String userDescription;
            if (humidity > roomLabel.rhUpperLimit || humidity<roomLabel.rhLowerLimit)
            { 
              userDescription += "Humidity is outside the limit (" + String(roomLabel.rhLowerLimit) + "-" 
                                + String(roomLabel.rhUpperLimit) + "RH%). Current humidity is " + String(humidity) + "RH%\n";
            }

            if (temperature > roomLabel.tempUpperLimit || temperature<roomLabel.tempLowerLimit)
            {
              userDescription += "Temperature is outside the limit (" + String(roomLabel.tempLowerLimit) + "-" 
                               + String(roomLabel.tempUpperLimit) + "C). Current temperature is " + String(temperature) + "C";
            }
            String systemDesciption;
            String exceptionMessage = ExceptionMessage::getExceptionMessageText(roomLabel.systemId.c_str(), 
                                                                                "",//batchID.c_str(), 
                                                                                PU.c_str(),
                                                                                "System Description", 
                                                                                userDescription.c_str(), 
                                                                                timeStampString.c_str());
            mylog(exceptionMessage);

            sendQueue.push(exceptionMessage);
          }
        }
      }
      else if (myType == epH)
      {
        float pH = pHMeter.getpH();
        mylog(pH);
        mylog("pH\n");
        if ( pHMeter.upperLimit > pHMeter.lowerLimit 
        &&  (pH > pHMeter.upperLimit || pH<pHMeter.lowerLimit)
        &&  (millis() - lastExceptionSent>exceptionSendInterval))
        {
            String batchID = pHMeter.lastBatchId;
            lastExceptionSent = millis();
            String timeStampString = getUTC();

            String userDescription;
            userDescription += "pH value is outside the limit (" + String(pHMeter.lowerLimit) + "-" 
                              + String(pHMeter.upperLimit) + "pH). Current pH is " + String(pH) + "pH\n";
            String systemDesciption;
            String exceptionMessage = ExceptionMessage::getExceptionMessageText(pHMeter.systemId.c_str(), 
                                                                                batchID.c_str(), 
                                                                                "",//PU.c_str(),
                                                                                "System Description", 
                                                                                userDescription.c_str(), 
                                                                                timeStampString.c_str());
            mylog(exceptionMessage);

            sendQueue.push(exceptionMessage);
        }

      }
    }

    if (millis() > nextDisplayUpdate)
    {
      nextDisplayUpdate = millis() + DISPLAYUPDATEINTERVAL;
      displayOledScreen();
    }

  }
  
  if (!digitalRead(TRIGGER_PIN1))
  {
    Serial.print("1");
  }
  if (!digitalRead(TRIGGER_PIN2))
  {
    Serial.print("2");
  }
  
  if (millis() - lastPasXInteraction > pasXWatchDogTime)
  {
    mylog("\n############################################################################\n");
    mylog(getNow());
    mylog("################################ watchdog reset ############################\n");
    mylog("############################################################################\n", true);
    delay(100);
    ESP.restart();
  }


  // Check if WLAN is connected
  if (WiFi.status() != WL_CONNECTED)
  {   
    mylog("reconnecting...");
    WiFi.reconnect();
    mylog("reconnected!\n");
  }
  server.handleClient();
}

